#lang reader "edot-2015-reader.rkt"


А I Алфавиттагы беренче хәрефнең – «А» хәрефенең исеме. А хәрефе рәвешендә
мәйданга керү капкасы да ясасагыз, иллә шәп буласы ---. Мәдәни җомга

А II, А-А-А ы. 1) Кем белән дә булса
очрашкач, таныганлыкны, нәрсәне дә
булса искә төшерүне белдерә. А! Габ-
дулла агай! Әйдә, түргә уз. Һ.Такташ
2) Кем яки нәрсәне дә булса күргәч
туган шатлануны, канәгатьлекне бел­
дерә. А, ишетсәгез лә, китерегез, ки-
терегез миңа чәчәкләр!.. Ф.Әмирхан.
– А, нинди яхшы биредә! – диде Шәмси,
эскәмиягә утырып. Г.Шәрипова
3) Кинәт килеп туган хәлгә га­
җәпләнүне белдерә. Җәлал тәрәзәгә
карады да, сискәнеп киткән адәм сы-
ман: – А..., яктырып беткән икән...
Соңга калмасак ярар иде. Тизрәк бу-
лырга кирәк, – дип урыныннан торды.
Г.Ибраһимов. А! Сез ничек болай тиз
килеп җиттегез! Казан утлары
4) Ризасызлык, канәгатьсезлек, ки­
лешмәгәнлекне яки нәфрәтләнүне
бел­дерә. – Син нәрсә, үз-үзеңне яклый
ал­мыйсыңмыни? А, юкны сөйләмә! –
Искәндәр йөзен чытты. Г.Шәрипова.
– А-а! Агулы елан! Дөньядан юк ит­
мәкчеме мине? Бозарга уйладыңмы? –
дип, бөтен йортка акырды Ишми һәм,
табылдыкны селки-селки, эчке күлмәк-
ыштаннан гына кухняга йөгереп керде.
Г.Шәрипова

А III, А-А-А иярт. Физик яки мо-
раль газаптан ыңгырашканда, елаганда
чыккан тавышны белдерә. – А-а-а! –
дип кычкыра-кычкыра арып беттем.
Н.Дәүли. Тешем сызлый – һич түзәр
чама юк. А-а-а, зинһар ярдәм ит, Га-
фур. Г.Шәрипов

АБА ы. к. абау

АБАГА и. бот. 1) Асплениячәләр
семьялыгыннан, юан, кыска тамыр-
чалы, яфраклары каурыйсыман телгә­
ләнгән, төньяк ярымшарның уртача зо-
насы урманнарында үсә, чәчәк атмый-
ча, споралар ярдәмендә үрчи торган
югары төзелешле үсемлек, русчасы:
папоротник. Абаганың чәчәген тел
ас­тына алсаң, имеш, күренмәс кеше­
гә әйләнәсең, ди. Әкият. Ахырдан, бер­
ничә еллар узгач, мин «уфалла» арбасы
белән бу урманнан утын ташыдым.
Абагалар беткән, мәче башлы яба-
лаклар да күренми иде. М.Мәһдиев.
Безнең урманнардагы абагалар – күпь­
еллык үләнчел үсемлекләр. Алар дым-
лы, күләгә урында, еш кына урман яп-
масы астында һәм дымлы ерымнарда
үсәләр. Биология
2) күч. Кышын бозланган тәрә­
зәләрдә була торган, шул үсемлек яф-
рагына охшаш бизәк. Тышта, салкын
тәрәзәләрдә – беренче абагаларның
сихерле яфраклары. А.Гыйләҗев
◊ Абага чәчәк аткач Бервакытта да,
беркайчан да булмаячак эш турында

АБАГАЛЫ с. Абагалар күп үскән,
абагалар булган. Абагалы урманнарның
Бормалы сукмаклары, Каерылып ка-
рап калган Каеннар, усаклары... Ф.Ча­
нышева. Мәгърур Чатыр тау, аба-
галы каен урманнары, гүзәл Ык, сез
кайчандыр Екатерина II нең безнең
төбәк­ләрдән үтүен күреп калгансыз.
М.Галиев

АБАГАЛЫК и. Абагалар күп үскән
урын. Озак бара торгач, малайлар куе
абагалыкка очрадылар. Казан утлары

АБАГА́СЫМАН с. Абагага охша-
ган, абага төсле. Абагасыман үсем­
лекләр, ягъни абага, плаун һәм нарат-
башлар, мүкләр кебек үк, псилофит-
лардан – борынгы үлеп беткән җир
өсте үсемлекләреннән килеп чыккан-
нар. Ботаника

АБАГА́СЫМАННАР и. бот. Күбе­
сенчә җир өстендә үсә торган, юга-
ры төзелешле споралы үлән һәм агач
үсемлек төренең атамасы; русчасы:
папоротниковидные, папоротни­ко­
об­ра́зные. Борынгы абагасыманнар
су­лык­ларның ярлары буенда гына үсү
бе­лән чикләнмәгәннәр, бәлки агачсы-
ман гигант үсемлекләрдән торган
ис­киткеч зур урманнар тәшкил ит­
кән­нәр. Моннан 300 млн. ел элек коры
җир­дә абагасыманнар хакимлек ит­
кән. Биология

АБАЖУР и. фр. Яктылык күзне ча-
гылдырмасын һәм тиешле урынга гына
тупланып төшсен өчен, лампага куела
торган җайланма. Түшәмнең кыл урта-
сында --- абажуры тутыккан егермеле
керосин лампасы асылынып тора иде.
Ф.Хөсни. Лампаның яшел абажуры,
бүлмәне моңлы караңгылык эчендә кал-
дырып, өстәлнең бер почмагына гына
якты чәчә. Гали Рәхим

АБАЖУРЛЫ с. Абажуры булган,
аба­жур куелган. – Без, кышкы салкын
кичләрдә, – дип сөйләгән иде ул, – бө­
тен гаиләбез белән җылы залдагы зур
түгәрәк өстәл тирәсенә җые­лып, яшел
абажурлы асылмалы лампа яктысын-
да һәркайсыбыз нәрсә дә булса укып
утыра идек. Ә.Еники. Өстәл­дә зәңгәр
абажурлы лампа яна. Р.Ишморат. ---
уртада – язу өстәле, аның өстендә –
абажурлы лампа. Җ.Фәйзи

АБАЙ с. 1. Сак, сизгер, уяу. Абай
кеше.
2. ы. мәгъ. сөйл. Нинди дә булса
эшне тыйганда, сак, сизгер, уяу бу-
лырга өндәп, истә тотуны таләп итеп
әйтелә; акрын. Абай, артыңда машина
кузгалырга тора.