#lang reader "edot-2015-reader.rkt"


А I Алфавиттагы беренче хәрефнең – «А» хәрефенең исеме. А хәрефе рәвешендә
мәйданга керү капкасы да ясасагыз, иллә шәп буласы ---. Мәдәни җомга

А II, А-А-А ы. 1) Кем белән дә булса
очрашкач, таныганлыкны, нәрсәне дә
булса искә төшерүне белдерә. А! Габ-
дулла агай! Әйдә, түргә уз. Һ.Такташ
2) Кем яки нәрсәне дә булса күргәч
туган шатлануны, канәгатьлекне бел­
дерә. А, ишетсәгез лә, китерегез, ки-
терегез миңа чәчәкләр!.. Ф.Әмирхан.
– А, нинди яхшы биредә! – диде Шәмси,
эскәмиягә утырып. Г.Шәрипова
3) Кинәт килеп туган хәлгә га­
җәпләнүне белдерә. Җәлал тәрәзәгә
карады да, сискәнеп киткән адәм сы-
ман: – А..., яктырып беткән икән...
Соңга калмасак ярар иде. Тизрәк бу-
лырга кирәк, – дип урыныннан торды.
Г.Ибраһимов. А! Сез ничек болай тиз
килеп җиттегез! Казан утлары
4) Ризасызлык, канәгатьсезлек, ки­
лешмәгәнлекне яки нәфрәтләнүне
бел­дерә. – Син нәрсә, үз-үзеңне яклый
ал­мыйсыңмыни? А, юкны сөйләмә! –
Искәндәр йөзен чытты. Г.Шәрипова.
– А-а! Агулы елан! Дөньядан юк ит­
мәкчеме мине? Бозарга уйладыңмы? –
дип, бөтен йортка акырды Ишми һәм,
табылдыкны селки-селки, эчке күлмәк-
ыштаннан гына кухняга йөгереп керде.
Г.Шәрипова

А III, А-А-А иярт. Физик яки мо-
раль газаптан ыңгырашканда, елаганда
чыккан тавышны белдерә. – А-а-а! –
дип кычкыра-кычкыра арып беттем.
Н.Дәүли. Тешем сызлый – һич түзәр
чама юк. А-а-а, зинһар ярдәм ит, Га-
фур. Г.Шәрипов